test_cases/2d/aero_1h_2d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table (
    (0.00000 (0.29394 0 0))
    (0.05000 (0.86391 0 0))
    (0.10000 (0.97429 0 0))
    (0.15000 (1.04529 0 0))
    (0.20000 (1.09878 0 0))
    (0.25000 (1.14215 0 0))
    (0.30000 (1.17885 0 0))
    (0.35000 (1.21080 0 0))
    (0.40000 (1.23917 0 0))
);
        direction       (0 0 1);
        origin          0;
    }
    outlet    { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    ground    { type noSlip; }
    buildings { type noSlip; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
