test_cases/2d/aero_1h_2d/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet     { type calculated; value uniform 0; }
    outlet    { type calculated; value uniform 0; }
    ground    { type nutkWallFunction; value uniform 0; }
    buildings { type nutkWallFunction; value uniform 0; }
    top       { type calculated; value uniform 0; }
    sides     { type symmetry; }
}

// ************************************************************************* //
