test_cases/2d/aero_1h_2d/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    buildingCells; type cellSet; action new;
        source  boxToCell; box (7.2614 4.6171 0)(7.6133 5.1389 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.1206 5.7911 0)(6.6753 6.1255 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.0836 0.8502 0)(6.778 1.342 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8974 3.3377 0)(10.6145 3.8172 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2133 1.0826 0)(7.756 1.6261 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2317 6.5985 0)(10.6445 6.9815 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.924 2.7749 0)(11.5819 3.1679 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.0209 2.657 0)(13.5872 2.9837 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.1603 6.7377 0)(11.7842 7.2341 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.2534 1.8794 0)(5.8065 2.4193 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0999 4.7929 0)(12.8196 5.2466 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.6382 3.9166 0)(12.1387 4.2751 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.4612 3.8434 0)(10.1287 4.4104 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8023 1.2824 0)(9.506 1.6344 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.481 5.4531 0)(10.8544 5.7711 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0936 1.0291 0)(5.612 1.6043 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.5394 4.3316 0)(11.0835 4.7362 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4814 4.8362 0)(4.8659 5.402 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8837 2.1196 0)(12.4944 2.6923 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (2.625 3.7053 0)(2.9464 4.2313 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.5851 2.5911 0)(5.2418 2.9794 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.974 6.5992 0)(5.2837 6.9422 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.5819 1.1309 0)(10.0338 1.4875 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.1844 5.0935 0)(8.9461 5.6549 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5825 6.6782 0)(6.1683 7.0733 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.0612 3.6118 0)(11.5581 3.9812 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.8829 3.2826 0)(6.5695 3.6967 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5061 5.8591 0)(12.2695 6.2024 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.7295 3.8167 0)(7.0999 4.1337 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.8416 1.3622 0)(4.2106 1.8522 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7459 1.1589 0)(12.0713 1.7341 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2896 4.8863 0)(10.6798 5.3352 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.9173 1.192 0)(8.4547 1.7592 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.9018 3.1753 0)(5.6174 3.7331 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9002 2.3835 0)(10.2783 2.8105 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (2.5007 6.2185 0)(2.8451 6.7398 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.1936 3.4912 0)(13.5509 3.8757 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.2701 5.0414 0)(6.8844 5.5658 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7584 5.1146 0)(8.0991 5.6492 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.6877 3.571 0)(8.2744 4.1204 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.0368 3.3425 0)(3.6678 3.8057 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6238 2.5429 0)(9.2029 3.0527 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (2.5708 2.8411 0)(2.9818 3.3981 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.5747 1.4046 0)(10.9379 1.7665 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.8711 4.539 0)(13.3206 4.9094 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.8706 4.3917 0)(8.1749 4.7244 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8112 4.2151 0)(9.4243 4.7723 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8073 1.5206 0)(10.1191 1.9346 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.9053 2.931 0)(8.4708 3.4935 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.1751 5.9398 0)(8.4975 6.402 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.6062 0.8267 0)(4.166 1.2978 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.1725 2.1905 0)(6.6756 2.6903 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.9568 6.4756 0)(12.2908 7.0431 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.1615 5.8291 0)(3.4907 6.34 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7698 2.0495 0)(4.4069 2.6474 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.1027 2.1081 0)(3.4513 2.4223 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3428 5.3643 0)(5.7609 5.7714 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.0819 3.9058 0)(6.4785 4.409 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.0626 4.8508 0)(4.3964 5.1792 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.5688 4.2514 0)(4.1449 4.6026 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.4251 1.6044 0)(6.991 2.0907 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (2.7772 1.1065 0)(3.2091 1.5168 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0189 3.1529 0)(12.7846 3.506 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.3203 6.3661 0)(13.7472 6.6843 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.8752 3.1994 0)(7.2861 3.6388 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0191 4.4018 0)(5.3895 4.8822 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.6978 2.5938 0)(6.0213 2.9839 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (2.9006 6.4463 0)(3.457 6.9831 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8946 2.769 0)(12.3006 3.0932 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.6962 5.5881 0)(13.4307 5.955 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.5342 5.24 0)(10.1107 5.7088 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4298 1.4245 0)(4.9999 2.001 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.0046 3.2072 0)(9.3131 3.8007 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.9827 1.3937 0)(13.4693 1.9884 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2461 3.9997 0)(4.949 4.4881 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8135 5.873 0)(10.1172 6.1942 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6243 6.6654 0)(9.0938 7.2053 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5018 2.1896 0)(7.833 2.5876 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.6388 5.8773 0)(7.9904 6.4625 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.2169 1.3678 0)(12.7668 1.9185 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.7823 6.4322 0)(7.2634 6.8092 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3747 3.814 0)(5.7458 4.2616 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.8107 5.9575 0)(4.2454 6.5495 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.9703 1.0525 0)(11.3632 1.4798 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.4731 2.8236 0)(10.8085 3.1457 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0888 6.1359 0)(5.8156 6.5213 0.4);
    }
    {
        name    fluid; type cellSet; action new;
        source  cellToCell; set buildingCells;
    }
    {
        name    fluid; type cellSet; action invert;
    }
);

// ************************************************************************* //
